# Terminal Stuff
brew "bat"
brew "colima", restart_service: :changed
brew "cmake"
brew "coreutils"
brew "d2"
brew "delta"
brew "entr"
brew "eza"
brew "fd"
brew "fish"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "grep"
brew "helix"
brew "helm"
brew "kubectl"
brew "libpq", link: true
brew "macos-trash"
brew "ollama"
brew "podman"
brew "podman-compose"
brew "openshift-cli"
brew "pandoc"
brew "pass"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "syncthing"
brew "tmux"
brew "universal-ctags"
brew "uv"
brew "vim"
brew "vivid"
brew "volta"
brew "wget"
brew "yt-dlp"
brew "zoxide"

# Apps
cask "basictex"
cask "dbeaver-community"
cask "figma"
cask "logitech-camera-settings"
cask "microsoft-edge"
cask "obs"
cask "rectangle"
cask "tailscale-app"
cask "visual-studio-code"
cask "wacom-tablet"
cask "wezterm"

# Fonts
cask "font-departure-mono-nerd-font"
cask "font-charter"
