tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# Terminal
cask "iterm2"
brew "tmux"
brew "entr"

# Source code Management
brew "git"

# Developer Stuff
brew "vim"
brew "nvi"
cask "docker"
brew "universal-ctags"

# SH
brew "shellcheck"
brew "shfmt"
brew "bashdb"

# Make
brew "checkmake"

# C
brew "clang-format"

# Photo Stuff
cask "adobe-dng-converter"

# Writing
brew "pandoc"

# Video
brew "ffmpeg"
cask "mpv"
brew "mpv"
brew "yt-dlp"

# Gamer Stuff
cask "discord"
cask "parsec"
cask "openemu"

# Web Stuff
cask "google-chrome"
cask "tor-browser"
cask "transmission"

# vi: ft=ruby
