tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"

# Developer Stuff
brew "emacs-plus" "--with-modern-doom-icon" "--with-native-comp"
brew "starship"
brew "nvim"
brew "git"
brew "tmux"
brew "entr"
brew "telnet"
brew "fd"
brew "gh"
brew "coreutils"
brew "grep"
brew "ripgrep"
brew "rename"
brew "shellcheck"
brew "wget"
brew "node"
brew "prettier"
cask "wezterm"
brew "python@3.11"
brew "python@3.10"
brew "docker"
brew "docker-compose"
brew "colima"

# Writing
brew "pandoc"

# Video
brew "ffmpeg"
cask "mpv"
brew "mpv"
brew "yt-dlp"
brew "streamlink"

# Gamer Stuff
cask "discord"

# Web Stuff
cask "google-chrome"
cask "transmission"
cask "firefox"

# OS Stuff
cask "appcleaner"
cask "backblaze"
cask "miniwol"

# Art Stuff
cask "adobe-dng-converter"
cask "freac"

# Fonts
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "font-cooper-hewitt"
cask "font-charter"
cask "font-ibm-plex"
cask "font-commit-mono-nerd-font"