tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# Terminal
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "iterm2"
cask "godot"
brew "tmux"
brew "entr"
brew "nq"
brew "fd"
brew "rg"
brew "lynx"
brew "streamlink"

# Source code Management
brew "gh"
brew "git"

# Developer Stuff
brew "vim"
cask "docker"
cask "vagrant"
brew "universal-ctags"
brew "podman"
brew "qemu"

# SH
brew "shellcheck"
brew "shfmt"
brew "bashdb"

# Make
brew "checkmake"

# C
brew "clang-format"

# Photo Stuff
cask "adobe-dng-converter"
cask "darktable"
cask "digikam"

# Ebook Stuff
cask "calibre"

# Writing
brew "pandoc"
cask "obsidian"

# Video
brew "ffmpeg"
cask "mpv"
brew "mpv"
brew "yt-dlp"

# Gamer Stuff
cask "discord"
cask "logitech-g-hub"
cask "parsec"
cask "openemu"

# Web Stuff
cask "google-chrome"
cask "tor-browser"
cask "transmission"

# Art Stuff
cask "krita"
cask "lmms"
cask "wacom-tablet"

# Utilities

# vi: ft=ruby
