tap "d12frosted/emacs-plus"               # Enhanced Emacs

brew "bat"                                # Enhanced cat.
brew "cmake"                              # Lots of source needs it.
brew "colima", restart_service: :changed  # Alternative to Docker Desktop.
brew "coreutils"                          # GNU coreutils.
brew "entr"                               # Run processes on file change.
brew "eza"                                # Ergonomic ls replacement.
brew "fd"                                 # Ergonomic alternative to find.
brew "ffmpeg"                             # Video and Audio manipulation.
brew "fzf"                                # General fuzzy finder.
brew "gh"                                 # Github client.
brew "git"                                # More up to date than xcode git.
brew "gpg"                                # For generating public keys.
brew "helix"                              # Cool litted text editor.
brew "lynx"                               # DDG stuff from the console.
brew "macos-trash"                        # Trash, instead of delete, files.
brew "mas"                                # Install from Mac App Store.
brew "nvi"                                # Sometimes I like to use vi.
brew "ollama"                             # Run LLMs.
brew "pandoc"                             # Universal document converter.
brew "plantuml"                           # Generate UML diagrams from code.
brew "podman"                             # Replacement for docker.
brew "podman-compose"                     # Replacement for docker-compose.
brew "qemu"                               # For running virtual machines.
brew "rename"                             # Bulk renaming.
brew "ripgrep"                            # More ergonomic grep.
brew "shellcheck"                         # Helps me write shell scripts.
brew "starship"                           # Zero config prompt.
brew "stow"                               # I use this to manage dotfiles.
brew "streamlink"                         # Watch videos in mpv.
brew "telnet"                             # Mostly for nethack.
brew "tmux"                               # Persistent sessions.
brew "uv"                                 # Python runner and venv manager.
brew "vim"                                # My go to text editor.
brew "volta"                              # Node runner.
brew "wget"                               # File downloader.
brew "yt-dlp"                             # Youtube Downloader.

# The one true operating system.
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-modern-doom3-icon"]

# Apps
cask "adobe-dng-converter"       # Convert my RAWs to DNG.
cask "basictex"                  # Use pandoc to generate PDF files.
cask "calibre"                   # EBook manager.
cask "chatterino"                # Much better than the twitch web interface.
cask "discord"                   # It's discord.
cask "foobar2000"                # Play music files.
cask "freac"                     # Audio transcoding.
cask "iterm2"                    # Decent terminal emulator.
cask "itermai"                   # Query an LLM for shell commands.
cask "logitech-camera-settings"  # Configure my webcam.
cask "musicbrainz-picard"        # Tag my music.
cask "rectangle"                 # Window Manager.
cask "steermouse"                # Configure mouses.
cask "stolendata-mpv"            # A very good video player.
cask "transmission"              # Torrent client.
cask "trex"                      # Easily OCR text.
cask "vscodium"                  # IDE.

mas "10ten Japanese Reader", id: 1573540634   # Japanese dictionary.
mas "AdGuard for Safari", id: 1440147259      # Block ads.
mas "Bitwarden", id: 1352778147               # Password Manager.
mas "Capture Passthru", id: 1610925225        # Low latency video capture.
mas "Dark Reader for Safari", id: 1438243180  # Dark themes for the web.
mas "Enchanted", id: 6474268307               # Ollama GUI client.
mas "Hush", id: 1544743900                    # Banish cookie popups.
mas "Keynote", id: 409183694                  # Office stuff.
mas "Numbers", id: 409203825                  # Office stuff
mas "Pages", id: 409201541                    # Office stuff.
mas "Pixelmator Pro", id: 1289583905          # Should be part of MacOS.
mas "Stop The Madness Pro", id: 6471380298    # Make the web tolerable.
mas "Things", id: 904280696                   # Todo list.

# Fonts
cask "font-bigblue-terminal-nerd-font"  # IBM terminal font.
cask "font-commit-mono-nerd-font"       # Generic font.
cask "font-departure-mono-nerd-font"    # Pixel font.
cask "font-eldur"                       # Occult font.
cask "font-charter"                     # Presentation font.
