# -*- mode: ruby -*-
# vi: ft=ruby

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "railwaycat/emacsmacport"

# Terminal Utilities
brew "tmux"
brew "nq"
brew "entr"
brew "ffmpeg"
brew "pandoc"

# Terminal Applications
brew "lynx"
brew "streamlink"
brew "podman"
brew "qemu"
brew "mpv"

# Source code Management
brew "gh"
brew "git"

# Photo Stuff
cask "adobe-dng-converter"
cask "darktable"
cask "digikam"

# Ebook Stuff
cask "calibre"

# Developer Stuff
brew "shellcheck"
brew "checkmake"
brew "cmake"
brew "universal-ctags"
brew "clang-format"
cask "docker"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "iterm2"
cask "godot"
cask "vagrant"

######################
# Stuff for Doom Emacs
brew "railwaycat/emacsmacport/emacs-mac", args: [
  "with-modules",
  "with-native-comp",
  "with-natural-title-bar",
]

# Core dependencies
brew "fd"
brew "rg"
brew "coreutils"
brew "gcc"

# Stuff for org-mode
cask "mactex"
brew "gnuplot"

# Terminal Emulator
brew "libvterm"
######################

# Gamer Stuff
cask "discord"
cask "logitech-g-hub"
cask "parsec"

# Web Stuff
cask "google-chrome"
cask "tor-browser"
cask "transmission"

# Art Stuff
cask "krita"
cask "lmms"
cask "wacom-tablet"

# Utilities
cask "mpv"
cask "raycast"
