# Ergonomics
brew "bat"                         # Cat
brew "chawan"                      # Text mode web browser `cha`
brew "curl"                        # Mostly for wcurl, a better wget
brew "delta"                       # Diff
brew "ducker"                      # Docker
brew "eza"                         # Ls
brew "fd"                          # Find
brew "fish"                        # Shell
brew "fzf"                         # Fuzzy finder
brew "gh"                          # Github
brew "git"                         # Source Control
brew "gitu"                        # TUI for git
brew "helix"                       # Vim
brew "macos-trash"                 # Trash files instead of delete
brew "rename"                      # Mass file renaming
brew "ripgrep"                     # Grep
brew "starship"                    # Shell prompt
brew "vivid"                       # Ls colours
brew "zoxide"                      # Cd

# Development Tools
brew "entr"                        # Run commands on file write
brew "helm"                        # Compile k8s yamls for testing
brew "kubectl"                     # Testing k8s deploys locally
brew "libpq", link: true           # For the psql client
brew "openshift-cli"               # OpenShift interface
brew "docker"                      # Containers
brew "docker-compose"              # Containers
brew "docker-buildx"               # Containers
brew "uv"                          # Python environment management
brew "volta"                       # NodeJS environment management

# Services
brew "ollama"                      # Local LLMs
brew "syncthing"                   # File sync
brew "colima"                      # Containers

# LSPs
brew "markdown-oxide"              # Markdown
brew "typescript-language-server"  # ts
brew "lua-language-server"         # lua
brew "dockerfile-language-server"  # Dockerfile
brew "docker-compose-langserver"   # docker-compose.yml

# Formatters
brew "prettier"                    # js, ts, css, md, html, GraphQL, yaml
brew "stylua"                      # lua

# Other Tools
brew "pandoc"                      # Universal document converter
brew "stow"                        # Manage dot files
brew "yt-dlp"                      # Video downloader
