tap "d12frosted/emacs-plus"

# Terminal Stuff
brew "bat"
brew "colima", restart_service: :changed
brew "cmake"
brew "coreutils"
brew "delta"
brew "docker"
brew "docker-compose"
brew "entr"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "grep"
brew "helix"
brew "helm"
brew "kubectl"
brew "libpq", link: true
brew "lynx"
brew "macos-trash"
brew "nvi"
brew "ollama"
brew "openshift-cli"
brew "pandoc"
brew "pass"
brew "plantuml"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "streamlink"
brew "telnet"
brew "tmux"
brew "universal-ctags"
brew "uv"
brew "vim"
brew "vivid"
brew "volta"
brew "wget"
brew "yt-dlp"
brew "zoxide"

brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-modern-doom3-icon"]

# Apps
cask "basictex"
cask "dbeaver-community"
cask "dteoh-devdocs"
cask "figma"
cask "iterm2"
cask "logitech-camera-settings"
cask "microsoft-edge"
cask "obs"
cask "rectangle"
cask "rectangle"
cask "visual-studio-code"
cask "wacom-tablet"

# Fonts
cask "font-departure-mono-nerd-font"
cask "font-charter"

# VSCode extensions

vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "maattdd.gitless"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.live-server"
vscode "orta.vscode-jest"
vscode "ryanluker.vscode-coverage-gutters"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-canadian-english"
vscode "vitest.explorer"
vscode "vscodevim.vim"
