# vi: ft=ruby

brew "entr"
brew "fd"
brew "lynx"
brew "nq"
brew "pandoc"
brew "podman"
brew "qemu"
brew "rg"
brew "tmux"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "iterm2"
brew "universal-ctags"
cask "docker"
cask "vagrant"
