# vi: ft=ruby

# Ebook stuff
cask "calibre"

# Game stuff
cask "discord"
cask "logitech-g-hub"
cask "parsec"

# Photo stuff
cask "adobe-dng-converter"
cask "darktable"
cask "digikam"

# System stuff
cask "raycast"

# Video stuff
brew "ffmpeg"
brew "streamlink"
brew "mpv"
cask "mpv"

# Web stuff
cask "google-chrome"
cask "tor-browser"
cask "transmission"
